In [2]:
import pandas as pd

In [3]:
'11 12 13 14'.split()

['11', '12', '13', '14']

In [5]:
data = [(1, 2, 3, 4), 
       (5, 6, 7, 8),
       (9, 10, 11, 12),
       (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [6]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [7]:
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [8]:
type(df['c1'])

pandas.core.series.Series

In [9]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [10]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [11]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [12]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [15]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

In [20]:
# o loc permite que você faça seleçoes a partir dos rótulos (indexes) das linhas:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [21]:
# Para fazer a mesma seleção com o loc, mas retornar um DataFrame ao invés de uma Series:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [24]:
# Utilizando o loc para selecionar um único item específico:
df.loc['l3', 'c2']

10

In [25]:
# Utilizando o iloc é possível fazer a mesma coisa, porém através dos indexes numéricos que estão implícitos nos rótulos:
df.iloc[2, 1]

10

In [27]:
# Para selecionar mais de um valor específico desta forma e criar um pequeno DataFrame com esse valores:
df.loc[['l3', 'l4'], ['c2', 'c1']]

    c2  c1
l3  10   9
l4  14  13

In [29]:
df.iloc[[2, 3], [1, 0]]

    c2  c1
l3  10   9
l4  14  13